$ FTP

FTP stands for *File Transfer Protocol*.

{ command line #ftp-command-line


  { Interactive mode

    With `mput` or `mget` multiple files can be sent using the star (`*`) on file names.

    If ftp is in interactive mode, however, each file must be confirmed:
code {
ftp> mput foo*.txt
mput foo-001.txt?
code }

   This can be turned of by going into non interactive mode. If it is using interactive mode or not can be queried with `prompt`:

code {
ftp> prompt
Interactive mode off.
ftp> mput foo*.txt
local: foo-001 remote: foo-001.txt
…
code }

    Alternatively, ftp can be started with the `-i` command line flag to turn of interactive prompting.

  }
  { Automatic login with password

    See: → Linux/fhs/home/username/_netrc

  }

}
{ Active vs passive mode #ftp-active-passive-mode

  A FTP session consists of two → development/web/TCP-IP connections, a *data* and a *command* connection (also referred to as data and command channel).

  In both, active and passive mode, the command connection is initiated by the client.
  -
  With active mode, the data connection is initiated from the server to the client, with passive mode, the client not only starts the command connection, but also the data connection.

  When the client is behind a firewall or the router is performing network address translation (NAT), passive mode should (must?) be used.

  { quote pasv

    In a ftp session, passive mode can be entered with a `quote` command.
code {
ftp> quote pasv
code }

   According to → https://stackoverflow.com/a/28833096/180275[this] and
   → https://stackoverflow.com/a/59805900/180275[this] Stackoverflow answers, `quote pasv` does not cause → Windows/dirs/Windows/System32/ftp_exe[`ftp.exe`] to enter passive mode *if*
   the value of `Use PASV` under the → Windows/registry key → Windows/registry/tree/HKEY_CURRENT_USER/Software/Microsoft/FTP[`HKEY_CURRENT_USER\Software\Microsoft\FTP`] is set to `yes`.

  }

}
{ Accessing a ftp server from a web browser

  Some (most?, all?) → development/web/browser[web browsers] allow to access an ftp server with username and password with the following → development/web/URI-URL-URN-IRI-URC#url[URL] syntax where the *username* is separated from
  the *password* with colons and the password is separated from the ftp server name with a at-sign:
code {
ftp://USERNAME:PASSWORD@ftp.server.xyz/path/to/resource
code }

  → development/tools/scripts/personal/ff_ftp_bat[ff_ftp.bat] is a → Windows/dirs/Windows/System32/cmd_exe/batch-files[`cmd.exe` batch file] that creates such a URL from certain → Windows/development/environment-variables[environment variables]
  and then opens a → development/web/browser/Firefox with the assembled URL.
}
{ 501 Syntax error in IP address

  When I encountered *501 Syntax error in IP address* for `ls` or `dir`, entering passive helped:
code {
$ ftp $IPADDR
Connected to …
220 …
Name (…:rene):
331 User rene OK. Password required
Password:
230 OK. Current directory is /
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> ls
501 Syntax error in IP address
ftp: bind: Address already in use
ftp> dir
501 Syntax error in IP address
ftp> pass
Passive mode on.
ftp> dir
227 Entering Passive Mode (…)
150 Accepted data connection
drwx--x---   10 rene       1301             4096 Mar 27 15:58 .
drwx--x---   10 rene       1301             4096 Mar 27 15:58 ..
…
code }

}
{ TODO

  Apparently, there is SFTP and FTPS (which are not the same thing).

}

sa:

  → development/languages/Perl/modules/Net/FTP/index, → development/web/TFTP 

  → tools/lftp

  The → Windows command line tool is → Windows/dirs/Windows/System32/ftp_exe[`ftp.exe`].
  -
  A popular graphical FTP client (that also has a server edition) is → tools/FileZilla.

  → development/web

  The → Microsoft/dot-net/namespaces-classes/System/Net/WebClient/UploadFile#WebClient-upload-ps[PowerShell example that uploads a file to an ftp server]

  The → Windows/registry key → Windows/registry/tree/HKEY_CURRENT_USER/Software/Microsoft/FTP[`HKEY_CURRENT_USER\Software\Microsoft\FTP`].
